02_openfoam_cfd/source_package/gaganyaan_openfoam_v3_3d_canopy_research/cases/02_drogue_full_3D/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     foamRun;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         800;
deltaT          1;
writeControl    timeStep;
writeInterval   200;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    forceCoeffs_canopy
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        patches         (canopy);
        p               p;
        U               U;
        rho             rhoInf;
        rhoInf          0.5252;
        CofR            (0 0 0);
        dragDir         (1 0 0);
        liftDir         (0 1 0);
        pitchAxis       (0 0 1);
        magUInf         120;
        lRef            5.8;
        Aref            26.4207942167;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   20;
    }
}
