02_openfoam_cfd/source_package/gaganyaan_openfoam_v3_3d_canopy_research/cases/02_drogue_full_3D/constant/physicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}

viscosityModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 1.5e-05;
