02_openfoam_cfd/source_package/gaganyaan_openfoam_v3_3d_canopy_research/cases/02_drogue_full_3D/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet { type zeroGradient; }
    outlet { type fixedValue; value uniform 0; }
    farField { type zeroGradient; }
    canopy { type zeroGradient; }
}
